In [1]:
# Veri analizi kütüphanesidir.
#conda install pandas
import numpy as np
import pandas as pd

## Seriler / series

In [2]:
benimSozlugum={"Atil":50,"Zeynep": 40,"Mehmet":30}

In [3]:
pd.Series(benimSozlugum) #seri oluşturma

Atil      50
Zeynep    40
Mehmet    30
dtype: int64

In [4]:
benimYaslarim=[30,40,50]
benimİsimlerim=["Atil","Zeynep","Mehmet"]

In [5]:
pd.Series(benimYaslarim)

0    30
1    40
2    50
dtype: int64

In [6]:
pd.Series(benimYaslarim,benimİsimlerim)

Atil      30
Zeynep    40
Mehmet    50
dtype: int64

In [7]:
pd.Series(data=benimYaslarim,index=benimİsimlerim)

Atil      30
Zeynep    40
Mehmet    50
dtype: int64

In [8]:
numpyDizisi=np.array([50,40,30])

In [9]:
numpyDizisi

array([50, 40, 30])

In [10]:
pd.Series(numpyDizisi)

0    50
1    40
2    30
dtype: int32

In [11]:
pd.Series(numpyDizisi,benimİsimlerim)

Atil      50
Zeynep    40
Mehmet    30
dtype: int32

In [12]:
pd.Series(["Atıl","Atlas","Osman"],[1,2,3]) # serilere farklı veri türlerini tutabilirler.

1     Atıl
2    Atlas
3    Osman
dtype: object

In [13]:
yarismaSonucu1=pd.Series([10,5,1],["Atıl","Atlas","Osman"])

In [14]:
yarismaSonucu1

Atıl     10
Atlas     5
Osman     1
dtype: int64

In [15]:
yarismaSonucu2=pd.Series([20,10,8],["Atıl","Atlas","Osman"])

In [16]:
yarismaSonucu2

Atıl     20
Atlas    10
Osman     8
dtype: int64

In [17]:
yarismaSonucu2["Atlas"]

10

In [18]:
sonSonuc=yarismaSonucu1+yarismaSonucu2
sonSonuc

Atıl     30
Atlas    15
Osman     9
dtype: int64

In [19]:
farkliSeries1=pd.Series([10,20,30,40],["A","B","C","D"])
farkliSeries2=pd.Series([50,60,7,80],["A","E","C","F"])

In [20]:
farkliSeries1

A    10
B    20
C    30
D    40
dtype: int64

In [21]:
farkliSeries2

A    50
E    60
C     7
F    80
dtype: int64

In [22]:
farklıToplam=farkliSeries1+farkliSeries2
farklıToplam

A    60.0
B     NaN
C    37.0
D     NaN
E     NaN
F     NaN
dtype: float64

## Data Frame

In [77]:
data=np.random.randn(4,3)

In [78]:
data

array([[ 1.50921189, -2.29449722, -0.21262559],
       [ 0.92003966, -0.69998386,  0.87448604],
       [-0.69896716,  0.98004373, -1.02178339],
       [-0.59062123,  1.31428364,  0.81656797]])

In [79]:
dataFrame=pd.DataFrame(data)

In [80]:
dataFrame

          0         1         2
0  1.509212 -2.294497 -0.212626
1  0.920040 -0.699984  0.874486
2 -0.698967  0.980044 -1.021783
3 -0.590621  1.314284  0.816568

In [81]:
type(dataFrame)

pandas.core.frame.DataFrame

In [82]:
yeniDataFrame=pd.DataFrame(data,index=["Atil","Zeynep","Emircan","Umut"],columns=["MAAS","YAS","ÇALIŞMA SAATİ"])

In [83]:
yeniDataFrame

             MAAS       YAS  ÇALIŞMA SAATİ
Atil     1.509212 -2.294497      -0.212626
Zeynep   0.920040 -0.699984       0.874486
Emircan -0.698967  0.980044      -1.021783
Umut    -0.590621  1.314284       0.816568

In [84]:
yeniDataFrame["YAS"]

Atil      -2.294497
Zeynep    -0.699984
Emircan    0.980044
Umut       1.314284
Name: YAS, dtype: float64

In [85]:
yeniDataFrame[["MAAS","YAS"]]

             MAAS       YAS
Atil     1.509212 -2.294497
Zeynep   0.920040 -0.699984
Emircan -0.698967  0.980044
Umut    -0.590621  1.314284

In [86]:
yeniDataFrame.loc["Atil"] #satırda arama yapma

MAAS             1.509212
YAS             -2.294497
ÇALIŞMA SAATİ   -0.212626
Name: Atil, dtype: float64

In [87]:
yeniDataFrame.iloc[1] #indeks bazlı arama yapma

MAAS             0.920040
YAS             -0.699984
ÇALIŞMA SAATİ    0.874486
Name: Zeynep, dtype: float64

In [88]:
yeniDataFrame

             MAAS       YAS  ÇALIŞMA SAATİ
Atil     1.509212 -2.294497      -0.212626
Zeynep   0.920040 -0.699984       0.874486
Emircan -0.698967  0.980044      -1.021783
Umut    -0.590621  1.314284       0.816568

In [89]:
yeniDataFrame["Emeklilik Yasi"]=yeniDataFrame["YAS"]*100 #Tabloya eyeni sütun ekleme
yeniDataFrame

             MAAS       YAS  ÇALIŞMA SAATİ  Emeklilik Yasi
Atil     1.509212 -2.294497      -0.212626     -229.449722
Zeynep   0.920040 -0.699984       0.874486      -69.998386
Emircan -0.698967  0.980044      -1.021783       98.004373
Umut    -0.590621  1.314284       0.816568      131.428364

In [90]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1) #tablodan bir sütun silme

             MAAS       YAS  ÇALIŞMA SAATİ
Atil     1.509212 -2.294497      -0.212626
Zeynep   0.920040 -0.699984       0.874486
Emircan -0.698967  0.980044      -1.021783
Umut    -0.590621  1.314284       0.816568

In [91]:
yeniDataFrame.drop("Zeynep") #tablodan 1 satır silme

             MAAS       YAS  ÇALIŞMA SAATİ  Emeklilik Yasi
Atil     1.509212 -2.294497      -0.212626     -229.449722
Emircan -0.698967  0.980044      -1.021783       98.004373
Umut    -0.590621  1.314284       0.816568      131.428364

In [92]:
yeniDataFrame #bir önceki yaptığımız işlemler DATE FRAME etki etmedi bunun etki etmesi için farklı şekilde belirtmemiz gerekiyor

             MAAS       YAS  ÇALIŞMA SAATİ  Emeklilik Yasi
Atil     1.509212 -2.294497      -0.212626     -229.449722
Zeynep   0.920040 -0.699984       0.874486      -69.998386
Emircan -0.698967  0.980044      -1.021783       98.004373
Umut    -0.590621  1.314284       0.816568      131.428364

In [93]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1,inplace=True) 
#inplace değeri başlangıç olarak false olarak gelir bu yüzden yaptığımız değişikler etki etmiyor. Eğer DATE FRAME'E etki etmesini istiyorsak inplace değerini True yapmalıyız.

In [94]:
yeniDataFrame

             MAAS       YAS  ÇALIŞMA SAATİ
Atil     1.509212 -2.294497      -0.212626
Zeynep   0.920040 -0.699984       0.874486
Emircan -0.698967  0.980044      -1.021783
Umut    -0.590621  1.314284       0.816568

In [95]:
yeniDataFrame.loc["Atil"]["YAS"]

-2.2944972192597723

In [96]:
yeniDataFrame.loc["Umut","YAS"]
yeniDataFrame

             MAAS       YAS  ÇALIŞMA SAATİ
Atil     1.509212 -2.294497      -0.212626
Zeynep   0.920040 -0.699984       0.874486
Emircan -0.698967  0.980044      -1.021783
Umut    -0.590621  1.314284       0.816568

In [97]:
booleanFrame=yeniDataFrame<0
booleanFrame

          MAAS    YAS  ÇALIŞMA SAATİ
Atil     False   True           True
Zeynep   False   True          False
Emircan   True  False           True
Umut      True  False          False

In [98]:
yeniDataFrame

             MAAS       YAS  ÇALIŞMA SAATİ
Atil     1.509212 -2.294497      -0.212626
Zeynep   0.920040 -0.699984       0.874486
Emircan -0.698967  0.980044      -1.021783
Umut    -0.590621  1.314284       0.816568

In [99]:
yeniDataFrame[booleanFrame] #sadece sıfırdan küçük değerleri gösteriyor.

             MAAS       YAS  ÇALIŞMA SAATİ
Atil          NaN -2.294497      -0.212626
Zeynep        NaN -0.699984            NaN
Emircan -0.698967       NaN      -1.021783
Umut    -0.590621       NaN            NaN

In [100]:
yeniDataFrame[yeniDataFrame<0]

             MAAS       YAS  ÇALIŞMA SAATİ
Atil          NaN -2.294497      -0.212626
Zeynep        NaN -0.699984            NaN
Emircan -0.698967       NaN      -1.021783
Umut    -0.590621       NaN            NaN

In [101]:
yeniDataFrame[yeniDataFrame["YAS"]>0] #YAŞI 0 dan büyük olan satırlarrı getiriyor sadece

             MAAS       YAS  ÇALIŞMA SAATİ
Emircan -0.698967  0.980044      -1.021783
Umut    -0.590621  1.314284       0.816568

In [102]:
yeniIndexListesi=["A","B","c","D"]

In [103]:
yeniDataFrame["Yeni Indeks"]=yeniIndexListesi

In [104]:
yeniDataFrame

             MAAS       YAS  ÇALIŞMA SAATİ Yeni Indeks
Atil     1.509212 -2.294497      -0.212626           A
Zeynep   0.920040 -0.699984       0.874486           B
Emircan -0.698967  0.980044      -1.021783           c
Umut    -0.590621  1.314284       0.816568           D

In [105]:
yeniDataFrame.set_index("Yeni Indeks",inplace=True)
#yeni indeks sütununu index olarak ayarladık. Kalıcı olması için inplace değerinin True yaptık.

In [106]:
yeniDataFrame

                 MAAS       YAS  ÇALIŞMA SAATİ
Yeni Indeks
A            1.509212 -2.294497      -0.212626
B            0.920040 -0.699984       0.874486
c           -0.698967  0.980044      -1.021783
D           -0.590621  1.314284       0.816568

In [107]:
ilkIndeksler=["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [108]:
icIndexler=["Homer","Bard","Marge","Cartman","Kenny","Kyle"]

In [109]:
birlesmisIndexler=list(zip(ilkIndeksler,icIndexler))

In [110]:
birlesmisIndexler

[('Simpson', 'Homer'),
 ('Simpson', 'Bard'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [112]:
birlesmisIndexler=pd.MultiIndex.from_tuples(birlesmisIndexler)

In [113]:
birlesmisIndexler

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bard'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [114]:
benimCizgiFilmListem=[[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [115]:
cizgiFilmNumpyDisizi=np.array(benimCizgiFilmListem)

In [118]:
cizgiFilmDataFrame=pd.DataFrame(cizgiFilmNumpyDisizi,index=birlesmisIndexler,columns=["YAS","Meslek"])

In [119]:
cizgiFilmDataFrame

                   YAS Meslek
Simpson    Homer    40      A
           Bard     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [120]:
cizgiFilmDataFrame.loc["Simpson"]

      YAS Meslek
Homer  40      A
Bard   10      B
Marge  30      C

In [121]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

YAS       10
Meslek     E
Name: Kenny, dtype: object

In [123]:
cizgiFilmDataFrame

                   YAS Meslek
Simpson    Homer    40      A
           Bard     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [124]:
cizgiFilmDataFrame.index.names=["Çizgi Film Adı","İsim"]

In [125]:
cizgiFilmDataFrame

                       YAS Meslek
Çizgi Film Adı İsim
Simpson        Homer    40      A
               Bard     10      B
               Marge    30      C
South Park     Cartman   9      D
               Kenny    10      E
               Kyle     11      F